[{"id":1651014000,"title":"markdown project\r","author":"Ian\r","date":"April 27, 2022\r","icon":"bi-markdown\r","content":"\r\nI have been lucky enough to work on a properly cool project as part of my day-job that involves adding a `markdown` blog to an existing application. I looked at a bunch of options, but eventually settled on the aptly name [react-markdown package](https://github.com/remarkjs/react-markdown).\r\n\r\nI was also able to find a really good series of videos on youtube and sat down to put what I could into place.\r\n\r\nIt was a really interesting and practical piece, as I can actually see the benefit of using this methodology instead of other `RSS feed` based alternatives.\r\n\r\nI'm now debating as to whether or not to implement it on this site, instead of using traditional `.tsx` files with mark-up.\r\n"},{"id":1649286000,"title":"AWS Amplify\r","author":"Ian\r","date":"April 07, 2022\r","icon":"bi-cloud\r","content":"\r\nI wanted to get an AWS instance up and running, as quickly as possible. So I have used AWS Amplify to power this project. At the moment, I have it set to build and deploy from my github instance and apart from some 'minor' issues in the beginning, it has been fairly pain free.\r\n\r\nThere are some great tutorials on setting up testing as part of the deploy process so that will probably be where I begin to focus my time in the near future.\r\n\r\nRight now I just want to add some more 'content' and get it working smoothly as a process.\r\n"},{"id":1646611200,"title":"Welcome\r","author":"Ian\r","date":"March 07, 2022\r","icon":"bi-house\r","content":"\r\nThis is my little play pen for ReactJs and AWS hobby projects. I'm hoping to add some experiments with ReactJs and other stuff soon. But like all good 'blog' type projects, this is very much a side-of-desk effort from home.\r\n\r\nThere are so many things happening in work that coming home and battering stuff into a 'blog' might be the very last thing I end up doing, but I'm going to try and treat this as more of an experimental zone.\r\n"}]