[{"id":1651014000,"title":"markdown project\r","author":"Ian\r","date":"04/27/2022\r","icon":"bi-markdown\r","image":"markdown.png\r","content":"\r\nI have been lucky enough to work on a properly cool project as part of my day-job that involves adding a `markdown` blog to an existing application.\r\n\r\nI looked at a bunch of options, but eventually settled on the aptly name [react-markdown package](https://github.com/remarkjs/react-markdown).\r\n\r\nI was also able to find a really good series of videos on youtube and sat down to put what I could into place.\r\n\r\nIt was a really interesting and practical piece, as I can actually see the benefit of using this methodology instead of other `RSS feed` based alternatives.\r\n\r\nI'm now debating as to whether or not to implement it on this site, instead of using traditional `.tsx` files with mark-up.\r\n"},{"id":1649286000,"title":"AWS Amplify\r","author":"Ian\r","date":"04/07/2022\r","icon":"bi-cloud\r","image":"aws-amplify.jpg\r","content":"\r\nI wanted to get an **AWS** instance up and running, as quickly as possible. So I have used **AWS Amplify** to power this project.\r\n\r\nAt the moment, I have it set to build and deploy from my `github` instance and apart from some 'minor' issues in the beginning, it has been fairly pain free.\r\n\r\nThere are some great tutorials on setting up testing as part of the deploy process so that will probably be where I begin to focus my time in the near future.\r\n\r\nRight now I just want to add some more 'content' and get it working smoothly as a process.\r\n"},{"id":1646611200,"title":"Welcome\r","author":"Ian\r","date":"03/07/2022\r","icon":"bi-house\r","image":"welcome-matt.jpg\r","content":"\r\nI've decided to move my `blog` from weestoater into this - a new little play pen for ReactJs and AWS hobby projects.\r\n\r\nI'm hoping to add some experiments with ReactJs and other stuff soon. But like all good 'blog' type projects, this is very much a side-of-desk effort from home.\r\n\r\nThere are so many things happening in work that coming home and battering stuff into a 'blog' might be the very last thing I end up doing, but I'm going to try and treat this as more of an experimental zone.\r\n\r\nI'll make an attempt to migrate the archive of nonsense I have from my old site onto this, but I'm not sure I'll go as far as implementing a `twitter` feed just yet, as I'm not exactly prolific on either burtware or weestoater accounts.\r\n"},{"id":1637193600,"title":"Find a job you love...\r","author":"Ian\r","date":"11/18/2021\r","icon":"bi-arrow-through-heart\r","image":"vscode-screengrab.png\r","content":"\r\n> and you'll never work a day in your life!\r\n\r\nAnyone who knows me will appreciate that I regularly recite this mantra but I’ve perhaps been fooling myself a little in that I haven’t really ‘loved’ my job for the last wee while.\r\n\r\nAfter some head scratching, a couple of properly difficult months and a bit of networking – I’ve made a sideways move to a Lead UI Developer role at work and am now finally following my long standing passion for all things front-end related.\r\n\r\nI’ve spent a good number of years doing pieces of SQL DB work, data handling and putting together different elements of the server-side, but if I’m honest with myself I’ve never really gotten the same kick as I do when I take a design and implement it in responsive, semantic html & css. The buzz from hitting `F5` on a browser and seeing a working website appear has never left me and nor do I ever want it to.\r\n\r\nIn my previous role I was more than happy to implement designs and get projects up and running visually, even doing the ‘admin’ stuff of pipelines, authentication and global load balancing too. I was challenged by some designs and had a great working relationship with the UX designers we had onboard. But there was always an expectation to do server-side stuff too, despite being relied on for my input and SME on front-end issues.\r\n\r\nI am now concentrating my time, effort and experience on helping a team of highly talented and driven UX designers and researchers build out a suite of quality applications which meet the users and business requirements. As part of this I will be working very closely with the respective development teams who maintain the different applications.\r\n\r\nI am going to be leaning heavily on my 20+ years in IT / web related roles, as well as flexing my Accessibility muscles a **lot** more as we aim to get as much of the tooling as possible to WCAG 2.1 AA.\r\n"},{"id":1634338800,"title":"Testing times\r","author":"Ian\r","date":"10/16/2021\r","icon":"bi-award\r","image":"testing-trophy.png\r","content":"\r\nIn a number of hobby projects I've been **banging my head** off the coding wall on how to tackle front end testing. I've been working in ReactJS a **lot**, for my projects, so decided to do a bit of research and I'm really glad I did.\r\n\r\nI found out about an amazingly talented developer called **Kent C. Dodds** and have been following his guidance on _what_ and _how to_ test things in JavaScript projects. So much so, in fact, that I got a Pro license for his incredible course at TestingJavaScript.com.\r\n\r\nHe covers everything from the **Fundamentals of testing** -> **Install, Configure, and Script Cypress for JavaScript Web Applications**.\r\n\r\nI've completed half of the sections so far and can honestly say it's changed the way I think about developing, let alone testing. I've not just learned about testing, I've also picked up a whole raft of tricks and tips on how to set up projects and my coding environment.\r\n\r\nI'm now using IntelliJ purely for Spring Boot and VS Code for all front end layer work.\r\n"},{"id":1604793600,"title":"(re)building the dream\r","author":"Ian\r","date":"11/08/2020\r","icon":"bi-bricks\r","image":"lego-landrover.png\r","content":"\r\nlike everybody and their dog (if you're lucky enough to have one) I've been trying to do some bits'n'bobs around the place during the joy that is _lockdown_. this particular venture is the rehash of my Christmas present Lego Land Defender.\r\n\r\nI made an heroic effort to construct it first time round, completing it in a matter of 3 or 4 rationed days. however, the reason there is a **need** for a **re**build, is that mistakes were made. experience is a valuable asset and in this case I've learned some incredibly useful techniques for _future_ builds.\r\n\r\nthat said, it's not been entirely painless on v.2 attempt. some brilliantly timed interruptions from the kids, dinner, sleep and working from home all mean it's not finished yet. but from a feel-good point of view, it's really done me the world of good. it's not painting the Sistine Chapel / landscaping the garden, but my well-being is massively lifted and where is the harm in that ?\r\n"},{"id":1597705200,"title":"Full stack journey\r","author":"Ian\r","date":"08/18/2020\r","icon":"bi-truck\r","image":"stone-stack.png\r","content":"\r\nI’ve been a `‘developer’` of some sort since about 1996, when I graduated from University. I’d been working in a couple of jobs whilst studying, doing database work and IT support in University ICT Labs.\r\n\r\nBut my first _‘real’_ job was as a Junior developer, where I mainly worked on interfaces, icons, some desktop publishing (met Evelyn Glennie) and other odds’n’sods. Very little, if any `‘back-end‘` work. It wasn’t really until I got into `.Net` stuff, **many** years later that I began to work on some `db services` and a bit of `Azure` too.\r\n\r\nIn my current role, I’m classed as a UX Engineer, but I’m trying to broaden my horizons a little and get to the underbelly of building API services, configuring load balancers, setting up authentication and CI build pipelines. Our firm uses Java – primarily Spring Boot, so working with it has been pretty involved. I am **blessed** with very patient and talented colleagues in my team. They have all been very supportive and helpful, whenever I’ve reached out or taken on sprint work which I am not at all within my comfort zone.\r\n\r\nMy goal is **absolutely not** to become a Java Engineer, or more entirely over to back end development, quite the opposite. I still passionately enjoy working on the User Interfaces of web applications and using React, Angular, ag-grid, css, html and js. I am aiming to be able to pick up a small project and build it entirely; back-end providing API endpoints from a DB; front end calling endpoints and populating UI; CI pipeline building and running test, before deploying to AWS / cloud environment.\r\n"},{"id":1588633200,"title":"ag-grid woes\r","author":"Ian\r","date":"05/05/2020\r","icon":"bi-table\r","image":"ag-grid.png\r","content":"\r\nI’m working on a nice project at the moment which involves using a new plugin for my team &raquo; ag-grid. It’s a `data-grid` package that promises to add a lot of functionality to our product, with a lot less effort than it would take to try and reinvent the wheel.\r\n\r\nOur first PoC was to see how simple it was to add to an existing react instance and then hook it up to data coming from a rest api call. All fairly painless – so far so good.\r\n\r\nThen the fun starts, with more functionality requests, a very talented colleague and myself proceeded to divide and conquer. Ticking off task after task, sometimes with little fuss and sometimes with far too much.\r\n\r\nWe are both in agreement of these things:-\r\n\r\n- documentation isn’t the best.\r\n- some simple examples that wet your appetite nicely;\r\n  - but when you’re looking for clear ‘how-to’ type examples they are not easy to find or comprehend\r\n- trying to do too much for too many\r\n  - it’s trying to support all the major front end JS frameworks, resulting in some wooly code and frequent head scratching.\r\n\r\nAll that aside – we have managed to hook up selectable columns and filtering for over 6500+ records. As well as incorporating\r\nExport to Excel functionality too – all within 4 days.\r\n\r\nIt appears to be performant on Internet Explorer, which is still the weapon of choice for browsing by the key stakeholders, but very performant on the likes of Chrome, Firefox and Safari.\r\n"},{"id":1579132800,"title":"ag-grid woes\r","author":"Ian\r","date":"01/16/2020\r","icon":"bi-emoji-smile\r","image":"happy-yellow.jpg\r","content":"\r\nSo far, so much better. It’s unsurprisingly obvious that a positive mindset leads to more stress-free days. \r\nThe odd _‘blip’_ does happen and dealing with them has been a lot more successful than I could have imagined.\r\n\r\n2019 was a stinker of a year, and I’ve made a conscious effort to remain positive by avoiding traits / experiences \r\nthat could affect that. It’s becoming increasingly easier as I continue to practice techniques and with my wonderful \r\nwife being super supportive as **always**.\r\n\r\nI am sure life will throw us some more crappy things to deal with, that’s only natural. What I can control though, \r\nis how I choose to react and at forty-seven years old, that’s been a big lesson – sadly learned the hard way.\r\n\r\nI want to be the best father, husband, pixel wrangler I can. Being kinder to myself and those around me is an \r\neasy and frankly enjoyable change to make. Seeing the kids laugh and giggle when I goof around is a really pleasant \r\nchange from how I’ve acted in the past. I feel the difference, and I hope that they do too.\r\n"}]