[{"id":1655852400,"title":"top gun - maverick\r","author":"Ian\r","date":"06/22/2022\r","icon":"bi-camera-reels\r","image":"maverick.jpg\r","content":"\r\nFinally managed to get a date arranged to meet up with the **Silver Fox** to go see the highly acclaimed \"Top Gun: Maverick\".\r\n\r\nLisa is **NOT** a _huge_ fan of the _pint-sized_ Mr. T Cruise, but I **love** the flight sequences - especially military aircraft ones like this. Between Top Gun and Firefox, with Clint Eastwood, I'm pretty much dying for the ariel footage.\r\n\r\nI'm delighted to say we got good seats, in a pretty quiet screening, despite the technology and a '**sick-note**' from the young girl on the till.\r\n\r\nLoved the film - absolutely loved it. Corny in places, totally HOLLYWOOD in fact, but exactly what was needed after a pretty zoned out day in front of a keyboard.\r\n\r\nGreat chance to catch-up with a good good friend and enjoy each others nonsense for a while.\r\n\r\n> You can be my wingman anytime Silver Fox!\r\n\r\nWill have to watch the original again, then go and see Maverick one more time on the big screen.\r\n"},{"id":1653606000,"title":"markdown project\r","author":"Ian\r","date":"05/27/2022\r","icon":"bi-markdown\r","image":"markdown.png\r","content":"\r\nI have been lucky enough to work on a properly cool project as part of my day-job that involves adding a `markdown` blog to an existing application.\r\n\r\nI looked at a bunch of options, but eventually settled on the aptly name [react-markdown package](https://github.com/remarkjs/react-markdown).\r\n\r\nI was also able to find a really good series of videos on youtube and sat down to put what I could into place.\r\n\r\nIt was a really interesting and practical piece, as I can actually see the benefit of using this methodology instead of other `RSS feed` based alternatives.\r\n\r\nI'm now debating as to whether or not to implement it on this site, instead of using traditional `.tsx` files with mark-up.\r\n\r\n## update - 06/06/22\r\n\r\nwell I bit the bullet and have implemented a `markdown` solution for the blog element of this site now. I'm **super** pleased with it, as it's everything I wanted it to be and it allows me the opportunity\r\nto migrate all the old posts from my personal site over to this and dial down my hosting fees.\r\n"},{"id":1649286000,"title":"AWS Amplify\r","author":"Ian\r","date":"04/07/2022\r","icon":"bi-cloud\r","image":"aws-amplify.jpg\r","content":"\r\nI wanted to get an **AWS** instance up and running, as quickly as possible. So I have used **AWS Amplify** to power this project.\r\n\r\nAt the moment, I have it set to build and deploy from my `github` instance and apart from some 'minor' issues in the beginning, it has been fairly pain free.\r\n\r\nThere are some great tutorials on setting up testing as part of the deploy process so that will probably be where I begin to focus my time in the near future.\r\n\r\nRight now I just want to add some more 'content' and get it working smoothly as a process.\r\n"},{"id":1646611200,"title":"Welcome\r","author":"Ian\r","date":"03/07/2022\r","icon":"bi-house\r","image":"welcome-matt.jpg\r","content":"\r\nI've decided to move my `blog` from weestoater into this - a new little play pen for ReactJs and AWS hobby projects.\r\n\r\nI'm hoping to add some experiments with ReactJs and other stuff soon. But like all good 'blog' type projects, this is very much a side-of-desk effort from home.\r\n\r\nThere are so many things happening in work that coming home and battering stuff into a 'blog' might be the very last thing I end up doing, but I'm going to try and treat this as more of an experimental zone.\r\n\r\nI'll make an attempt to migrate the archive of nonsense I have from my old site onto this, but I'm not sure I'll go as far as implementing a `twitter` feed just yet, as I'm not exactly prolific on either burtware or weestoater accounts.\r\n"},{"id":1637193600,"title":"Find a job you love...\r","author":"Ian\r","date":"11/18/2021\r","icon":"bi-arrow-through-heart\r","image":"vscode-screengrab.png\r","content":"\r\n> and you'll never work a day in your life!\r\n\r\nAnyone who knows me will appreciate that I regularly recite this mantra but I’ve perhaps been fooling myself a little in that I haven’t really ‘loved’ my job for the last wee while.\r\n\r\nAfter some head scratching, a couple of properly difficult months and a bit of networking – I’ve made a sideways move to a Lead UI Developer role at work and am now finally following my long standing passion for all things front-end related.\r\n\r\nI’ve spent a good number of years doing pieces of SQL DB work, data handling and putting together different elements of the server-side, but if I’m honest with myself I’ve never really gotten the same kick as I do when I take a design and implement it in responsive, semantic html & css. The buzz from hitting `F5` on a browser and seeing a working website appear has never left me and nor do I ever want it to.\r\n\r\nIn my previous role I was more than happy to implement designs and get projects up and running visually, even doing the ‘admin’ stuff of pipelines, authentication and global load balancing too. I was challenged by some designs and had a great working relationship with the UX designers we had onboard. But there was always an expectation to do server-side stuff too, despite being relied on for my input and SME on front-end issues.\r\n\r\nI am now concentrating my time, effort and experience on helping a team of highly talented and driven UX designers and researchers build out a suite of quality applications which meet the users and business requirements. As part of this I will be working very closely with the respective development teams who maintain the different applications.\r\n\r\nI am going to be leaning heavily on my 20+ years in IT / web related roles, as well as flexing my Accessibility muscles a **lot** more as we aim to get as much of the tooling as possible to WCAG 2.1 AA.\r\n"},{"id":1634338800,"title":"Testing times\r","author":"Ian\r","date":"10/16/2021\r","icon":"bi-award\r","image":"testing-trophy.png\r","content":"\r\nIn a number of hobby projects I've been **banging my head** off the coding wall on how to tackle front end testing. I've been working in ReactJS a **lot**, for my projects, so decided to do a bit of research and I'm really glad I did.\r\n\r\nI found out about an amazingly talented developer called **Kent C. Dodds** and have been following his guidance on _what_ and _how to_ test things in JavaScript projects. So much so, in fact, that I got a Pro license for his incredible course at TestingJavaScript.com.\r\n\r\nHe covers everything from the **Fundamentals of testing** -> **Install, Configure, and Script Cypress for JavaScript Web Applications**.\r\n\r\nI've completed half of the sections so far and can honestly say it's changed the way I think about developing, let alone testing. I've not just learned about testing, I've also picked up a whole raft of tricks and tips on how to set up projects and my coding environment.\r\n\r\nI'm now using IntelliJ purely for Spring Boot and VS Code for all front end layer work.\r\n"},{"id":1604793600,"title":"(re)building the dream\r","author":"Ian\r","date":"11/08/2020\r","icon":"bi-bricks\r","image":"lego-landrover.png\r","content":"\r\nlike everybody and their dog (if you're lucky enough to have one) I've been trying to do some bits'n'bobs around the place during the joy that is _lockdown_.\r\n\r\nthis particular venture is the rehash of my Christmas present Lego Land Defender.\r\n\r\nI made an heroic effort to construct it first time round, completing it in a matter of 3 or 4 rationed days. however, the reason there is a **need** for a **re**build, is that mistakes were made. experience is a valuable asset and in this case I've learned some incredibly useful techniques for _future_ builds.\r\n\r\nthat said, it's not been entirely painless on v.2 attempt. some brilliantly timed interruptions from the kids, dinner, sleep and working from home all mean it's not finished yet. but from a feel-good point of view, it's really done me the world of good. it's not painting the Sistine Chapel / landscaping the garden, but my well-being is massively lifted and where is the harm in that ?\r\n"},{"id":1597705200,"title":"Full stack journey\r","author":"Ian\r","date":"08/18/2020\r","icon":"bi-truck\r","image":"stone-stack.png\r","content":"\r\nI’ve been a `‘developer’` of some sort since about 1996, when I graduated from University. I’d been working in a couple of jobs whilst studying, doing database work and IT support in University ICT Labs.\r\n\r\nBut my first _‘real’_ job was as a Junior developer, where I mainly worked on interfaces, icons, some desktop publishing (met Evelyn Glennie) and other odds’n’sods. Very little, if any `‘back-end‘` work. It wasn’t really until I got into `.Net` stuff, **many** years later that I began to work on some `db services` and a bit of `Azure` too.\r\n\r\nIn my current role, I’m classed as a UX Engineer, but I’m trying to broaden my horizons a little and get to the underbelly of building API services, configuring load balancers, setting up authentication and CI build pipelines. Our firm uses Java – primarily Spring Boot, so working with it has been pretty involved. I am **blessed** with very patient and talented colleagues in my team. They have all been very supportive and helpful, whenever I’ve reached out or taken on sprint work which I am not at all within my comfort zone.\r\n\r\nMy goal is **absolutely not** to become a Java Engineer, or more entirely over to back end development, quite the opposite. I still passionately enjoy working on the User Interfaces of web applications and using React, Angular, ag-grid, css, html and js. I am aiming to be able to pick up a small project and build it entirely; back-end providing API endpoints from a DB; front end calling endpoints and populating UI; CI pipeline building and running test, before deploying to AWS / cloud environment.\r\n"},{"id":1588633200,"title":"ag-grid woes\r","author":"Ian\r","date":"05/05/2020\r","icon":"bi-table\r","image":"ag-grid.png\r","content":"\r\nI’m working on a nice project at the moment which involves using a new plugin for my team &raquo; ag-grid. It’s a `data-grid` package that promises to add a lot of functionality to our product, with a lot less effort than it would take to try and reinvent the wheel.\r\n\r\nOur first PoC was to see how simple it was to add to an existing react instance and then hook it up to data coming from a rest api call. All fairly painless – so far so good.\r\n\r\nThen the fun starts, with more functionality requests, a very talented colleague and myself proceeded to divide and conquer. Ticking off task after task, sometimes with little fuss and sometimes with far too much.\r\n\r\nWe are both in agreement of these things:-\r\n\r\n- documentation isn’t the best.\r\n- some simple examples that wet your appetite nicely;\r\n  - but when you’re looking for clear ‘how-to’ type examples they are not easy to find or comprehend\r\n- trying to do too much for too many\r\n  - it’s trying to support all the major front end JS frameworks, resulting in some wooly code and frequent head scratching.\r\n\r\nAll that aside – we have managed to hook up selectable columns and filtering for over 6500+ records. As well as incorporating\r\nExport to Excel functionality too – all within 4 days.\r\n\r\nIt appears to be performant on Internet Explorer, which is still the weapon of choice for browsing by the key stakeholders, but very performant on the likes of Chrome, Firefox and Safari.\r\n"},{"id":1579132800,"title":"all is good\r","author":"Ian\r","date":"01/16/2020\r","icon":"bi-emoji-smile\r","image":"happy-yellow.jpg\r","content":"\r\nSo far, so much better. It’s unsurprisingly obvious that a positive mindset leads to more stress-free days.  \r\nThe odd _‘blip’_ does happen and dealing with them has been a lot more successful than I could have imagined.\r\n\r\n2019 was a stinker of a year, and I’ve made a conscious effort to remain positive by avoiding traits / experiences  \r\nthat could affect that. It’s becoming increasingly easier as I continue to practice techniques and with my wonderful  \r\nwife being super supportive as **always**.\r\n\r\nI am sure life will throw us some more crappy things to deal with, that’s only natural. What I can control though,  \r\nis how I choose to react and at forty-seven years old, that’s been a big lesson – sadly learned the hard way.\r\n\r\nI want to be the best father, husband, pixel wrangler I can. Being kinder to myself and those around me is an  \r\neasy and frankly enjoyable change to make. Seeing the kids laugh and giggle when I goof around is a really pleasant  \r\nchange from how I’ve acted in the past. I feel the difference, and I hope that they do too.\r\n"},{"id":1578009600,"title":"dark side\r","author":"Ian\r","date":"01/03/2020\r","icon":"bi-apple\r","image":"iphone.jpg\r","content":"\r\nAfter **several years** using Android phones I have chosen to go back to Apple. The reasoning is fairly simple and possibly misguided.\r\n\r\nI’m using my works MacBook Pro more and more these days, so I’m going to try and eek out more of its’ productivity – i.e. joined-up-ness by utilising some of the ‘features’ of mac to mac devices.\r\n\r\nThere is a big **‘work’** shaped caveat to this, in that the MacBook Pro in question is **not** a factory install. Instead, a fair few elements have been removed and / or disabled.\r\n\r\nWish me luck I may well need it…\r\n\r\n**Update**\r\n\r\n> be careful what you wish for...\r\n\r\nAs suspected a LOT of the cool Mac functionality has indeed been locked down on the 'works' MacBook Pro. But that in itself is not too bad, as it's interfaces with the mobile apps I use for work are MUCH better.\r\n"},{"id":1565391600,"title":"loch katrine\r","author":"Ian\r","date":"08/10/2019\r","icon":"bi-tsunami\r","image":"loch-katrine.jpg\r","content":"\r\nAJ and I decided to go away for an overnight camping. I went online and found Loch Katrine campsite.\r\n\r\nIt mentioned the Steamship Sir Walter Scott and cycle routes down the side of the Loch from Stronachlachar.\r\n\r\n> Booking made = chuffed x 2.\r\n\r\nThen the biblical rain happened over the next few days, resulting in landslides that sadly closed off the cycle routes. But we soldiered on, drove up this morning, here nice and early, chose our tent pitch and did the Loch sailing.\r\n\r\nNipped into Callander for some supplies and got stuck behind a cycling event for what seemed like an eternity. Then made it back in perfect time to miss the rain but catch the midgies for pitching our tent.\r\n\r\nWe then hit the cafe for some shelter, as the rain wasn’t going to ease off any time soon. A bite to eat later and the weather calmed down enough for us to hit the road on the bikes. A great bit of road, nice a quiet, not too busy with other ‘tourists’ and a nice wee jaunt after dinner was had. Even took a wee breather by the viewpoint to soak up the amazing atmosphere – Gods country!\r\n\r\n![Loch Katrine](../assets/loch-katrine-2.jpg)\r\n"},{"id":1563231600,"title":"white heat of learnage\r","author":"Ian\r","date":"07/16/2019\r","icon":"bi-filetype-tsx\r","image":"react-logo-large.png\r","content":"\r\nSo this week saw me return to ‘work’ after a few weeks off on holiday with the family. Fully enjoyed, rested and raring to go.\r\n\r\nHappily though, it’s not a straight back to desk and heads down number. In fact, I’m in a training course for **three glorious days** in the sweltering heat of a Glasgow summer.\r\n\r\nOrdinarily I’d not complain, but with fans buzzing around the room and temperatures that would put an insomniac to sleep – I’m struggling.\r\n\r\nThe course content and pace is pretty good too – though a little bit of leaning towards `TypeScript` which isn’t the way I’m thinking of going with React.\r\n"},{"id":1562454000,"title":"test wrestler\r","author":"Ian\r","date":"07/07/2019\r","icon":"bi-cloud-sun\r","image":"pop-200-tent.jpg\r","content":"\r\nSo I thought I’d have a quick look at the _‘pop-up’_ tent so AJ and I could maybe boost for a day or two.\r\n\r\nWell, it certainly **‘pops’** out of the bag. Discovered it was missing the pegs it should have had – thanks to ebay that’s now resolved.\r\n\r\nSo happy with it’s condition and specification, needed to put it back in its’ wee bag. Thus began the fun and games. Should just be a little fold here and a tuck in there. How wrong can one man be…\r\n\r\nAfter a good **ten minutes** of no success. I threw in the towel and hit me googles. Praise be to youtube and the healing powers of watching someone who knows what they’re doing…\r\n"},{"id":1559084400,"title":"at last\r","author":"Ian\r","date":"05/29/2019\r","icon":"bi-tornado\r","image":"stressed-out.jpg\r","content":"\r\nToday marks the end of a pretty stressful old time in the weestoater team.\r\n\r\nHappily things appear to have turned a corner and should be on track for much better days.\r\n\r\nA new challenge awaits and I am part champing at the bitt / part making buttons.\r\n\r\nWatch this space…\r\n"},{"id":1552953600,"title":"cellulitus v2\r","author":"Ian\r","date":"03/19/2019\r","icon":"bi-thermometer-high\r","image":"leg-mess.jpg\r","content":"\r\nSo as if once wasn’t enough, back in Dec ’17. I’ve only gone and ended up in sun kissed Crosshouse Hospital, Kilmarnock again with that old favourite cellulitis.\r\n\r\nNo sepsis this time, just to keep the body guessing.\r\n\r\nIn the main a fairly rudimentary stay, a wee spell in Ambulatory Care – which was fun. Then a few days / nights in Day Surgery Unit (DSU). Just for giggles I got punted up to Ward 4D, in a rather nice side room all to myself. But back down to DSU before discharge.\r\n\r\nHave to get better compression rate on the leg in question as fluid buildup is the issue. Infection gets in and hey presto back to square one.\r\n\r\nThis visit has highlighted my lack of hydration discipline and the obvious Olympic standard of amazing that is my wife and family. My brother has looked in and looked out for my lot, which has definitely helped ease the worries. The usual band of good wishes from friends and colleagues too.\r\n\r\nHave to do right by all this good will and get my sorry act together.\r\n"},{"id":1552867200,"title":"refert centum annos\r","author":"Ian\r","date":"03/18/2019\r","icon":"bi-thermometer-high\r","image":"kelpies.jpg\r","content":"\r\nWallowing in self-pity has become all too easy...\r\n\r\nWhat with Cellulitus v2 (Cv2) reappearance and withdrawal of some important meds due to clashing with anti-biotics needed for treatment.\r\n\r\nBut just ‘cos I’m fat, over forty and ginger that doesn’t mean to say I should get away with it. There are a lot of folks a damned sight worse off than I who still manage to drag their backsides out of bed and get something of worth done each day.\r\n\r\nSo tubs – no more down down, deeper and down. Get your act together and make something useful of this time.\r\n"},{"id":1552694400,"title":"the road to learn react\r","author":"Ian\r","date":"03/16/2019\r","icon":"bi-code-slash\r","image":"road-to-learn-react.jpg\r","content":"\r\nI recenlty purchased a cracking book to help me learn the joys of React.\r\n\r\nI am happy to say it’s been a [hugely enjoyable experience](https://www.amazon.co.uk/gp/product/172004399X/ref=ppx_yo_dt_b_asin_title_o05_s00?ie=UTF8&psc=1).\r\n\r\nThe book, unlike others I’ve read, has a central project which you take from the start right through the book. Each chapter offers further reading or examples to look at for personal research / deeper understanding. This was a surprise to begin with, but much used as the topics became more and more involved.\r\n\r\nI’m really **really** happy with the end result and have a MUCH deeper insight into tackling things for my hobby and works projects. TDD isn’t covered in as much depth as I would have liked personally, but the examples given on testing do cover enough to give you a good jumping off point.\r\n"},{"id":1549497600,"title":"healthy progress\r","author":"Ian\r","date":"02/07/2019\r","icon":"bi-filetype-tsx\r","image":"code-screenshot.png\r","content":"\r\nAs part of the learning path towards Cloud Developer certification, I’ve decided to invest in `React` as my chosen UI/UX Framework.\r\n\r\nThe firm I work for has a great deal of projects using it and there is a clear cross over from my previous experience in `AngularJS` / `Angular`.\r\n\r\nI’m really happy with the work I’ve managed to achieve so far, thanks to the Pluralsight and some books I’ve managed to borrow from colleagues.\r\n\r\nThere are some simple differences I’ve enjoyed already, but some things are taking a little longer to sink in. Getting old I guess.\r\n"},{"id":1547856000,"title":"new challenge\r","author":"Ian\r","date":"01/19/2019\r","icon":"bi-cloud\r","image":"cloud_academy.jpg\r","content":"\r\nAs part of my personal development, through work, I’m going to try and gain some professional certification in the Cloud environment.\r\n\r\nWe have a corporate account with those wizards at Cloud Academy, so my first target will be to get AWS Developer certified.\r\n\r\nWe have a couple of different learning paths in work, which I’m happy to say I’ve already completed some of. So I should probably check to make sure I’m not skipping any vital steps / stages.\r\n\r\nThat said, I would like to get up-and-running on AWS asap, then start refactoring my suite of websites that I ‘host’ and ‘blog’ onto myself.\r\n\r\nWould be nice to not be beholden to ISP’s when I could manage them myself, possibly a lot cheaper too.\r\n"},{"id":1547251200,"title":"lovely day for it\r","author":"Ian\r","date":"01/12/2019\r","icon":"bi-umbrella\r","image":"football-with-boot.jpg\r","content":"\r\nAngus was back at 5 a sides this morning – and man was it a stunning return to the place.\r\n\r\nhorrid sleekit rain, that soaks you right through.\r\n\r\nIt threatened to really open up and pour it down, but luckily it held off. Some ‘choice’ tackles going in and poor Reece didn’t walk away from his coming together. Still, he’ll live to fight another day. The weather definitely played its part in some of the action.\r\n"},{"id":1543795200,"title":"mac and me\r","author":"Ian\r","date":"12/03/2018\r","icon":"bi-apple\r","image":"macbook-pro.jpg\r","content":"\r\nSo after many **MANY** years of mocking and undermining them, I am now the proud user of a MacBook Pro, for my sins.\r\n\r\nAs the _UX Architect/Engineer_ for my team I am tasked with a multitude of design related duties, wireframes, site maps, mockups etc.\r\n\r\nThe weapon of choice for the firm is the MBP with Sketch and Adobe CC. I am really liking Sketch as a tool and the difference in Adobe too.\r\n\r\nBut most of all I love the speed and simplicity of the MacBook itself. Git, npm, bash all run insanely fast. Code seems to compile faster too, even though I swore I wouldn’t put Java and IntelliJ on it.\r\n\r\nAll I need now is to lose a few stones, dye my beard and start wearing polo necks…\r\n"},{"id":1537052400,"title":"UX testing\r","author":"Ian\r","date":"09/16/2018\r","icon":"bi-bookmark-check\r","image":"ux-testing.jpg\r","content":"\r\nSo part of my new role at work is to try and improve the **User Experience** on one of the companies many (internal) sites.\r\n\r\nThe site in question has recently had a refresh and my initial involvement was to help port content from the previous design into the latest.\r\n\r\nDuring this I made some _observations_ about things I’d noticed and they seem to have been well received.\r\n\r\nI took the opportunity to contact the **UX designers** in Glasgow and then arranged some actual UX testing.\r\n\r\nThis comprised of 5 relatively simple tasks for users to carry out with an opportunity for more open feedback at the end.\r\n\r\nWith some initial technology glitches overcome, it was down to business. A satisfying amount of insight was gained, reinforcing some elements of the initial findings, but throwing up the expected unexpected.\r\n\r\nWriting up the notes and solution mock up now needed, but looking forward to presenting the findings to a receptive audience.\r\n"},{"id":1534892400,"title":"REACTing well\r","author":"Ian\r","date":"08/22/2018\r","icon":"bi-filetype-jsx\r","image":"react-logo-large.png\r","content":"\r\nI was recently tasked with building a ‘_dashboard_’, something else to learn.\r\n\r\nSo I hit my pluralsight tutorials and filled up on coffee.\r\n\r\nI also decided to take the plunge into the React world, as this is in vogue at the moment. Must say I am pleasantly surprised at how much I was able to achieve.\r\n\r\nI just need to get some **actual data** to use, then I can mock the heck out of this sucker.\r\n\r\nAlso managed to spark an idea for a Motherwell FC related side project.\r\n\r\nNext challenge is to get my head around handling the data to power it all.\r\n\r\nStill not a fan of _jsx_ mixed markup, but when in Rome…\r\n"},{"id":1533596400,"title":"head in the cloud\r","author":"Ian\r","date":"08/07/2018\r","icon":"bi-clouds\r","image":"head-in-the-clouds.jpg\r","content":"\r\nSo I came back from holidays and started in a new team.\r\n\r\nSame firm, building and floor – but different team, now I’m doing _UI Engineering for Automation_.\r\n\r\nA whole new bunch of people in a brand new team. They are all awesome but it’s straight into the work and getting up to speed.\r\n\r\nWe have a real mix of backgrounds and experience, which is fantastic as it means there are loads of opportunities to share knowledge and grow as a team.\r\n\r\nWouldn’t have it any other way.\r\n"},{"id":1518480000,"title":"agile ceremonies\r","author":"Ian\r","date":"02/13/2018\r","icon":"bi-kanban\r","image":"awesome.png\r","content":"\r\nTrying to be more disciplined at work with our **agile ceremonies**.  \r\n\r\nThey are a really important practice to help bridge some of the knowledge gaps in our team and the general concensus is that we’re doing well as a group.  With such a variety of work experience and coding backgrounds, it's hard to see sometimes how some people will work together as a pair, or in a 'mob'.\r\n\r\nOur working habits are improving steadily, with tickets getting created per job, sized and now that we’ve got our unit testing dialled in the hope is to rock some **TDD** out of our next deliverables.\r\n\r\nI’d like to get some CI pipeline elements in place, but the next ‘_agile thing_‘ I think we could benefit from would be continuous improvement. Setting ourselves a **definition of awesome** for the back end; front end and pipeline – would help us focus and maybe give us a chance to build in some continuous improvement into our sprints.\r\n\r\nBAU still needs to be a large part of the sprints, but a backlog of improvement tasks might do us any harm.\r\n"},{"id":1457568000,"title":"Heydon Pickering classic\r","author":"Ian\r","date":"03/10/2016\r","icon":"bi-filetype-css\r","image":"heydon-classic.png\r","content":"\r\nHeydon Pickering | Effortless Style | CSS Day from Web Conferences Amsterdam on [Vimeo](http://www.vimeo.com).\r\n\r\nClasses, and the CSS methodologies based on them, have begot a component based approach to styling web pages. This results in a form of presentational markup that, despite breaking with the “separation of concerns” principle, has proven to be a popular approach to collaborating on style schemas. \r\n\r\nHowever, methodologies and standards are not equivalent and inviting the explicit prescription of CSS into the editorial process will quickly alienate non-developers charged with simply writing content. This session will explore ways to help content editors elicit stylistic nuances without having to think about design or CSS at all.\r\n\r\n- Video: <https://player.vimeo.com/video/101718785?h=1aa6fce961>\r\n- Slides: <http://slides.com/heydon/effortless-style/>\r\n- About Heydon: <http://www.heydonworks.com>\r\n- More about CSS Day: <http://cssday.nl> or <https://twitter.com/cssdayconf>\r\n"}]